; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v3 - type_2 ?v5 - type_3)
 	      (pred_3 ?v2 - object ?v5 - type_3)
	      (pred_2 ?v3 - type_2 ?v7 - type_1)
	      (pred_4 ?v3 - type_2 ?v2 - object ?v7 - type_1))

   (:action op_3
       :parameters  (?v3 - type_2 ?v8 ?v6 - type_3)
       :precondition (and  (pred_1 ?v3 ?v8))
       :effect (and  (pred_1 ?v3 ?v6)
		     (not (pred_1 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_2 ?v1 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v4) (pred_1 ?v3 ?v4) (pred_2 ?v3 ?v7))
       :effect (and (pred_4 ?v3 ?v1 ?v7)
		    (not (pred_3 ?v1 ?v4)) 
		    (not (pred_2 ?v3 ?v7))))

   (:action op_2
       :parameters (?v3 - type_2 ?v1 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v3 ?v1 ?v7) (pred_1 ?v3 ?v4))
       :effect (and (pred_3 ?v1 ?v4)
		    (pred_2 ?v3 ?v7)
		    (not (pred_4 ?v3 ?v1 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_09 - type_2
obj_03 obj_12 obj_04 obj_10 - type_1
obj_05 obj_13 obj_08 obj_01 - type_3
obj_07 obj_11 obj_02 - object)
(:init
(pred_1 obj_06 obj_01)
(pred_2 obj_06 obj_03)
(pred_2 obj_06 obj_12)
(pred_1 obj_09 obj_08)
(pred_2 obj_09 obj_04)
(pred_2 obj_09 obj_10)
(pred_3 obj_07 obj_13)
(pred_3 obj_11 obj_08)
(pred_3 obj_02 obj_13)
)
(:goal
(and
(pred_3 obj_07 obj_08)
(pred_3 obj_11 obj_01)
(pred_3 obj_02 obj_13)
)
)

(:constraints
  (always (not (pred_1 obj_06 obj_08)))
)
)

; plan
1. (op_3 obj_06 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_05)
   goals met: 1 of 3
2. (op_1 obj_09 obj_11 obj_08 obj_10)
   deleted: (pred_3 obj_11 obj_08) (pred_2 obj_09 obj_10)
   added: (pred_4 obj_09 obj_11 obj_10)
   goals met: 1 of 3
3. (op_3 obj_09 obj_08 obj_01)
   deleted: (pred_1 obj_09 obj_08)
   added: (pred_1 obj_09 obj_01)
   goals met: 1 of 3
4. (op_3 obj_06 obj_05 obj_13)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_13)
   goals met: 1 of 3
5. (op_2 obj_09 obj_11 obj_01 obj_10)
   deleted: (pred_4 obj_09 obj_11 obj_10)
   added: (pred_3 obj_11 obj_01) (pred_2 obj_09 obj_10)
   goals met: 2 of 3
6. (op_3 obj_09 obj_01 obj_13)
   deleted: (pred_1 obj_09 obj_01)
   added: (pred_1 obj_09 obj_13)
   goals met: 2 of 3
7. (op_1 obj_09 obj_07 obj_13 obj_10)
   deleted: (pred_3 obj_07 obj_13) (pred_2 obj_09 obj_10)
   added: (pred_4 obj_09 obj_07 obj_10)
   goals met: 2 of 3
8. (op_3 obj_09 obj_13 obj_08)
   deleted: (pred_1 obj_09 obj_13)
   added: (pred_1 obj_09 obj_08)
   goals met: 2 of 3
9. (op_2 obj_09 obj_07 obj_08 obj_10)
   deleted: (pred_4 obj_09 obj_07 obj_10)
   added: (pred_3 obj_07 obj_08) (pred_2 obj_09 obj_10)
   goals met: 3 of 3
